spec/dummy/app/controllers/api/v1/testers_controller.rb

  def index
    respond_with Tester.all
---
SELECT "testers".* FROM "testers"

  def as_one
    respond_with Tester.first
---
SELECT  "testers".* FROM "testers"   ORDER BY "testers"."id" ASC LIMIT 1

  def single_as_arr
    respond_with Tester.where(id: 1).all
---
SELECT "testers".* FROM "testers" WHERE "testers"."id" = 1